tap "argoproj/tap"
tap "boz/repo"
tap "go-task/tap"
tap "jandedobbeleer/oh-my-posh"
tap "krishkrosh/apps"
tap "siderolabs/tap"
brew "age"
brew "ansible"
brew "argocd"
brew "htop"
brew "iperf3"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "krew"
brew "kubecolor"
brew "kubeseal"
brew "mtr"
brew "nmap"
brew "opentofu"
brew "restic"
brew "sops"
brew "talosctl"
brew "tree"
brew "wget"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "boz/repo/kail"
cask "1password-cli"
cask "git-credential-manager"
cask "openlens"
cask "trackweight"
vscode "4ops.terraform"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "davidanson.vscode-markdownlint"
vscode "dawhite.mustache"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.sentinel"
vscode "hashicorp.terraform"
vscode "ipedrazas.kubernetes-snippets"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "searking.preview-vscode"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "trunk.io"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
vscode "znck.grammarly"